export const regExp = {
    Reg_IDCardNo: /(^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$)|(^[1-9]\d{5}\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{2}[0-9Xx]$)/, // 身份证
    Reg_TelNo: /^1[3|4|5|6|7|8|9]\d{9}$/,// 手机号
    // Reg_PassWord: /^(\w){8,16}$/,// 登录密码
    //Reg_PassWord: /^(?![0-9]+$)(?![a-zA-Z]+$)[0-9A-Za-z]{6,10}$/,// 密码
    Reg_Number: /^\d{6}$/, // 验证数字
    Reg_Name: /^[\u4e00-\u9fa5]{2,6}$/,//验证名字
    Reg_Text: /^[0-9a-zA-Z\u4e00-\u9fa5`~!@#$^&*\\()=|{}':;',\\\\.<>/?~！@#￥……&*（）——|{}【】‘；：”“'。，、？%+_]{1,20}$/,
    Reg_email: /^(\w)+(\.\w+)*@(\w)+((\.\w{2,3}){1,3})$/,//邮箱
    RegNull: /^\s*$/g,// 空字符
    RegHtmlLabel: /<\/?.+?\/?>/g,// html标签
    invoiceTitle: /^[0-9a-zA-Z\(\)\（\）\u4e00-\u9fa5]{0,50}$/, //发票抬头
    identifyNumber: /^[A-Z0-9]{15}$|^[A-Z0-9]{17}$|^[A-Z0-9]{18}$|^[A-Z0-9]{20}$/, //纳税人识别号
    bankNumber: /^\d{16,19}$/, //银行卡
    SaftCode: /^\d{3}$/, //银行卡
    Reg_Uname: /^[a-zA-Z0-9_]{0,14}$|^[\u4e00-\u9fa5]{0,7}$/,//验证用户名
    Reg_PassWord: /^[a-zA-Z0-9_]{8,14}$/,// 密码
};
